src/config/Catalogs/Типоразмеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Типоразмеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диаметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОтверстий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PCD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вылет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаметрСтупицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нагрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаВДюймах</Name>
					<Comment>для грузовых шин</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Catalogs/Типоразмеры/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	//***01.2016 исключение недоступных
	#Если Клиент Тогда
		Отказ = ПроверитьРеквизитыНаНаличиеНедопустимыхСимволов();
	#КонецЕсли
	
	Если (ЭтоНовый()) Тогда 
		Если (Справочники.Типоразмеры.НайтиПоНаименованию(СокрП(Наименование),Истина) <> Справочники.Типоразмеры.ПустаяСсылка()) Тогда 
			Сообщить("Наименование " + Наименование);	
			Сообщить("Данный типоразмер уже существует !!!",СтатусСообщения.Важное);	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

	
КонецПроцедуры

Функция ПроверитьРеквизитыНаНаличиеНедопустимыхСимволов()
	
	ЕстьНедопустимыеСимволы = Ложь;
	
	СтрокаДопустимыхСимволов = "0123456789.Blank-/C";
	
	Для инд = 1 по СтрДлина(Ширина) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(Ширина,инд,1)) = 0 тогда
			Сообщить("В поле Ширина содержится недопустимый символ " + Сред(Ширина,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для инд = 1 по СтрДлина(Высота) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(Высота,инд,1)) = 0 тогда
			Сообщить("В поле Высота содержится недопустимый символ " + Сред(Высота,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для инд = 1 по СтрДлина(Диаметр) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(Диаметр,инд,1)) = 0 тогда
			Сообщить("В поле Диаметр содержится недопустимый символ " + Сред(Диаметр,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для инд = 1 по СтрДлина(КоличествоОтверстий) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(КоличествоОтверстий,инд,1)) = 0 тогда
			Сообщить("В поле Количество отверстий содержится недопустимый символ " + Сред(КоличествоОтверстий,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для инд = 1 по СтрДлина(PCD) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(PCD,инд,1)) = 0 тогда
			Сообщить("В поле PCD содержится недопустимый символ " + Сред(PCD,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для инд = 1 по СтрДлина(Вылет) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(Вылет,инд,1)) = 0 тогда
			Сообщить("В поле Вылет содержится недопустимый символ " + Сред(Вылет,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для инд = 1 по СтрДлина(ДиаметрСтупицы) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(ДиаметрСтупицы,инд,1)) = 0 тогда
			Сообщить("В поле Диаметр ступицы содержится недопустимый символ " + Сред(ДиаметрСтупицы,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для инд = 1 по СтрДлина(ШиринаВДюймах) Цикл
		Если Найти(СтрокаДопустимыхСимволов,Сред(ШиринаВДюймах,инд,1)) = 0 тогда
			Сообщить("В поле Ширина в дюймах содержится недопустимый символ " + Сред(ШиринаВДюймах,инд,1));
			ЕстьНедопустимыеСимволы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьНедопустимыеСимволы;
	
КонецФункции
